[
  {
    "name": "QML Style Manager",
    "description": "QML Style Manager is a powerful QGIS plugin designed to streamline the process of applying QML styles to layers within specific layer groups. This plugin is particularly useful for managing and styling large sets of geospatial data where consistent visual representation is crucial.",
    "iconUrl": "https://raw.githubusercontent.com/kentemman-gmd/gmd-plugins/refs/heads/main/icons/qml-style-manager.png",
    "repoUrl": "https://api.github.com/repos/Geotags-GMD/apply_qml_style/releases/latest",
    "category": "Plugins",
    "features": ["Folder Selection: Select a folder containing QML files.", "Layer Group Selection: Choose from available layer groups ending with _2024maplayers.", "Apply Styles: Automatically apply QML styles to layers based on their names.","Rearrange Layers: Organize layers within selected groups according to a specified order."],
    "latestUpdate": "Layers outside selected groups now get two styles applied"
  },
   {
    "name": "Color Categorizer",
    "description": "Color Categorizer plugin for QGIS allows users to apply categorized colors to layers based on attributes using color data from a JSON file. This tool helps automate the process of applying consistent styling to map layers, particularly useful for thematic mapping.",
    "iconUrl": "https://raw.githubusercontent.com/kentemman-gmd/gmd-plugins/refs/heads/main/icons/color_categorizer.png",
    "repoUrl": "https://api.github.com/repos/Geotags-GMD/color_categorizer/releases/latest",
    "category": "Plugins",
    "features": ["Select a layer and attribute field to categorize.", "Load color data from a JSON file and display it in an editable table.", "Customize colors using a built-in color picker.","Apply categorized color symbology to the selected layer.","Save and load settings, including previously selected JSON paths, layers, and attributes."],
    "latestUpdate": "Automatically apply the colors to your layer based on attribute values"
  },

  {
    "name": "Error List Checker",
    "description": "This plugin allows users to validate geospatial data by checking for discrepancies in facility names and sector categories. It generates a detailed errorlist for review.",
    "iconUrl": "https://raw.githubusercontent.com/kentemman-gmd/gmd-plugins/refs/heads/main/icons/error-list.png",
    "repoUrl": "https://api.github.com/repos/Geotags-GMD/error_list_checker/releases/latest",
    "category": "Plugins",
    "features": [""],
    "latestUpdate": ""
  },

  {
    "name": "QField Modified",
    "description": "The QField Modified Plugin provides four key functions: Package for QField, which allows users to filter barangay data for export and generate a QField Project; Map Generation, which loads base layers, satellite imagery, reference data, a built-in tagging layer for CBMS Form 8, and a built-in value relation that automatically loads into QGIS; Processing, which operates similarly to Map Generation for processing layers; and Filter Geocode, where users select a barangay layer to filter the geocode and automatically apply filters to barangay, enumeration area, building point layers, and more.
",
    "iconUrl": "https://raw.githubusercontent.com/kentemman-gmd/Plugin_OnDev/refs/heads/main/icon/auqcbms.png",
    "repoUrl": "https://api.github.com/repos/Geotags-GMD/download/releases/latest",
    "category": "Plugins",
    "features": [""],
    "latestUpdate": ""
  },
   {
    "name": "Overlap Processing",
    "description": "To process building points on the overlap areas for the 2024 POPCEN-CBMS",
    "iconUrl": "https://raw.githubusercontent.com/kentemman-gmd/Plugin_OnDev/refs/heads/main/icon/overlapping.png",
    "repoUrl": "https://api.github.com/repos/Geotags-GMD/overlap_processing/releases/latest",
    "category": "Plugins",
    "features": [""],
    "latestUpdate": ""
  }
]
